OpenFOAM_Benchmarks/dambreakColagrossi/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0)
    (1.61 0 0)
    (3.22 0 0)
    (0 0.9 0)
    (1.61 0.9 0)
    (3.22 0.9 0)
    (0 1.8 0)
    (1.61 1.8 0)
    (3.22 1.8 0)
    (0 0 0.01)
    (1.61 0 0.01)
    (3.22 0 0.01)
    (0 0.9 0.01)
    (1.61 0.9 0.01)
    (3.22 0.9 0.01)
    (0 1.8 0.01)
    (1.61 1.8 0.01)
    (3.22 1.8 0.01)
);

blocks          
(
    hex (0 1 4 3 9 10 13 12) (80 45 1) simpleGrading (1 1 1)
    hex (1 2 5 4 10 11 14 13) (80 45 1) simpleGrading (1 1 1)
    hex (4 5 8 7 13 14 17 16) (80 45 1) simpleGrading (1 1 1)
    hex (3 4 7 6 12 13 16 15) (80 45 1) simpleGrading (1 1 1)
);

edges           
(
);

patches
(
    wall leftWall
        (
            (0 9 12 3)
            (3 12 15 6)
        )
    wall rightWall
        (
            (2 11 14 5)
            (5 14 17 8)
        )
    wall lowerWall
        (
            (0 1 10 9)
            (1 2 11 10)
        )
    patch atmosphere
        (
            (6 15 16 7)
            (7 16 17 8)
        )
);

mergePatchPairs
(
);

// ************************************************************************* //
