OpenFOAM_Benchmarks/dambreakColagrossi/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;

maxDeltaT       1;

libs ( "libOpenFOAM.so" ) ;

functions
{
    probesP
        {
            // Where to load it from
            functionObjectLibs ( "libsampling.so" );
    
            type        probes;
    
            // Name of the directory for probe data
            name        probesP;
            probeLocations
            (
		(	3.219	0.205	0.005	)
		(	3.219	0.185	0.005	)
		(	3.219	0.160	0.005	)
		(	3.219	0.135	0.005	)
		(	3.219	0.115	0.005	)
		
            );
    
            // Fields to be probed
            fields ( p );
    
            // Write at same frequency as fields
            outputControl   timeStep;
            outputInterval  1;
    }
}

// ************************************************************************* //
